# CIA Factbook Analysis

This analysis is based off the fourth course in the DataQuest data engineer course, SQL Fundamentals

# Goal

The goal of this project is to explore the CIA factbook dataset using SQL.

## Connect to the data

In [3]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

### Get the tables in the database

In [5]:
%%sql
SELECT * 
FROM sqlite_master
WHERE type = 'table'

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

### Take a look at the facts table

In [8]:
%%sql


SELECT *
FROM facts 
LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Start Analyzing the Data

Return the following:
1. Minimum population
2. Maximum population
3. Minimum population growth
4. Maximum population growth

In [12]:
%%sql
SELECT 
    min(population) "Minimum Population",
    max(population) "Maximum Population",
    min(population_growth) "Min Population Growth",
    max(population_growth) "Max Population Growth"
FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

Looks there may be some problems with the data. For example, there is a country with a minimum population of 0. Also, there is a country with a population of 7.2 billion people. In 2017, the total Earth's population was around 7.5 billion.

Now I will take a closer look at these countries.

In [14]:
%%sql

SELECT name,min(population) as population
FROM facts

Done.

[('Antarctica', 0)]

Anatarctia having a population of 0 makes sense as no one permanently lives there.

In [16]:
%%sql

SELECT name, max(population) as population
FROM facts

Done.

[('World', 7256490011)]

It looks like the world is also in this dataset so that is why the population is 7.2 billion on the above row.

### Average Country Sizes

Now I will take a look ath the average values in the dataset.

In [21]:
%%sql
SELECT
    round(avg(population),0) "Avg Population",
    round(avg(area),1) "Avg Area (km^2)"
FROM facts

Done.

[(62094928.0, 555093.5)]

We calculated an average population of 62.1 million people and average area size of 555k square kilometres.

Finally, we will take a look at the most densely populated countrys by finding populations that are greater than the average and area is smaller than the average.

In [26]:
%%sql

SELECT
    name as Country,
    population,
    area
FROM facts
WHERE population > (SELECT avg(population) FROM facts)
    AND area < (SELECT avg(area) FROM facts)

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]